Heltec-Aaron-Lee/WiFi_Kit_series/boards.txt
wireless_bridge.name=Wireless Bridge

wireless_bridge.bootloader.tool=esptool_py
wireless_bridge.bootloader.tool.default=esptool_py

wireless_bridge.upload.tool=esptool_py
wireless_bridge.upload.tool.default=esptool_py
wireless_bridge.upload.tool.network=esp_ota

wireless_bridge.upload.maximum_size=3342336
wireless_bridge.upload.maximum_data_size=327680
wireless_bridge.upload.wait_for_upload_port=true
wireless_bridge.upload.flags=
wireless_bridge.upload.extra_flags=

wireless_bridge.serial.disableDTR=true
wireless_bridge.serial.disableRTS=true

wireless_bridge.build.tarch=xtensa
wireless_bridge.build.bootloader_addr=0x1000
wireless_bridge.build.target=esp32
wireless_bridge.build.mcu=esp32
wireless_bridge.build.core=esp32
wireless_bridge.build.variant=wireless_bridge
wireless_bridge.build.board=wireless_bridge

wireless_bridge.build.f_cpu=240000000L
wireless_bridge.build.flash_size=8MB
wireless_bridge.build.flash_freq=80m
wireless_bridge.build.flash_mode=dio
wireless_bridge.build.boot=dio
wireless_bridge.build.partitions=default_8MB
wireless_bridge.build.defines=-D{build.band} -DLoRaWAN_DEBUG_LEVEL={build.LoRaWanDebugLevel} -DACTIVE_REGION=LORAMAC_{build.band} -DLORAWAN_PREAMBLE_LENGTH={build.LORAWAN_PREAMBLE_LENGTH} -DLORAWAN_DEVEUI_AUTO={build.LORAWAN_DEVEUI_AUTO} -D{build.board} -DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue
wireless_bridge.build.extra_libs=-lheltec

wireless_bridge.menu.CPUFreq.240=240MHz (WiFi/BT)
wireless_bridge.menu.CPUFreq.240.build.f_cpu=240000000L
wireless_bridge.menu.CPUFreq.160=160MHz (WiFi/BT)
wireless_bridge.menu.CPUFreq.160.build.f_cpu=160000000L
wireless_bridge.menu.CPUFreq.80=80MHz (WiFi/BT)
wireless_bridge.menu.CPUFreq.80.build.f_cpu=80000000L

wireless_bridge.menu.UploadSpeed.921600=921600
wireless_bridge.menu.UploadSpeed.921600.upload.speed=921600
wireless_bridge.menu.UploadSpeed.115200=115200
wireless_bridge.menu.UploadSpeed.115200.upload.speed=115200
wireless_bridge.menu.UploadSpeed.256000.windows=256000
wireless_bridge.menu.UploadSpeed.256000.upload.speed=256000
wireless_bridge.menu.UploadSpeed.230400.windows.upload.speed=256000
wireless_bridge.menu.UploadSpeed.230400=230400
wireless_bridge.menu.UploadSpeed.230400.upload.speed=230400
wireless_bridge.menu.UploadSpeed.460800.linux=460800
wireless_bridge.menu.UploadSpeed.460800.macosx=460800
wireless_bridge.menu.UploadSpeed.460800.upload.speed=460800
wireless_bridge.menu.UploadSpeed.512000.windows=512000
wireless_bridge.menu.UploadSpeed.512000.upload.speed=512000

wireless_bridge.menu.DebugLevel.none=None
wireless_bridge.menu.DebugLevel.none.build.code_debug=0
wireless_bridge.menu.DebugLevel.error=Error
wireless_bridge.menu.DebugLevel.error.build.code_debug=1
wireless_bridge.menu.DebugLevel.warn=Warn
wireless_bridge.menu.DebugLevel.warn.build.code_debug=2
wireless_bridge.menu.DebugLevel.info=Info
wireless_bridge.menu.DebugLevel.info.build.code_debug=3
wireless_bridge.menu.DebugLevel.debug=Debug
wireless_bridge.menu.DebugLevel.debug.build.code_debug=4
wireless_bridge.menu.DebugLevel.verbose=Verbose
wireless_bridge.menu.DebugLevel.verbose.build.code_debug=5

wireless_bridge.menu.LORAWAN_REGION.0=REGION_EU868
wireless_bridge.menu.LORAWAN_REGION.0.build.band=REGION_EU868
wireless_bridge.menu.LORAWAN_REGION.1=REGION_EU433
wireless_bridge.menu.LORAWAN_REGION.1.build.band=REGION_EU433
wireless_bridge.menu.LORAWAN_REGION.2=REGION_CN470
wireless_bridge.menu.LORAWAN_REGION.2.build.band=REGION_CN470
wireless_bridge.menu.LORAWAN_REGION.3=REGION_US915
wireless_bridge.menu.LORAWAN_REGION.3.build.band=REGION_US915
wireless_bridge.menu.LORAWAN_REGION.4=REGION_AU915
wireless_bridge.menu.LORAWAN_REGION.4.build.band=REGION_AU915
wireless_bridge.menu.LORAWAN_REGION.5=REGION_CN779
wireless_bridge.menu.LORAWAN_REGION.5.build.band=REGION_CN779
wireless_bridge.menu.LORAWAN_REGION.6=REGION_AS923
wireless_bridge.menu.LORAWAN_REGION.6.build.band=REGION_AS923
wireless_bridge.menu.LORAWAN_REGION.7=REGION_KR920
wireless_bridge.menu.LORAWAN_REGION.7.build.band=REGION_KR920
wireless_bridge.menu.LORAWAN_REGION.8=REGION_IN865
wireless_bridge.menu.LORAWAN_REGION.8.build.band=REGION_IN865
wireless_bridge.menu.LORAWAN_REGION.9=REGION_US915_HYBRID
wireless_bridge.menu.LORAWAN_REGION.9.build.band=REGION_US915_HYBRID

wireless_bridge.menu.LoRaWanDebugLevel.0=None
wireless_bridge.menu.LoRaWanDebugLevel.0.build.LoRaWanDebugLevel=0
wireless_bridge.menu.LoRaWanDebugLevel.1=Freq
wireless_bridge.menu.LoRaWanDebugLevel.1.build.LoRaWanDebugLevel=1
wireless_bridge.menu.LoRaWanDebugLevel.2=Freq && DIO
wireless_bridge.menu.LoRaWanDebugLevel.2.build.LoRaWanDebugLevel=2
wireless_bridge.menu.LoRaWanDebugLevel.3=Freq && DIO && PW
wireless_bridge.menu.LoRaWanDebugLevel.3.build.LoRaWanDebugLevel=3

wireless_bridge.menu.LORAWAN_DEVEUI.0=CUSTOM
wireless_bridge.menu.LORAWAN_DEVEUI.0.build.LORAWAN_DEVEUI_AUTO=0
wireless_bridge.menu.LORAWAN_DEVEUI.1=Generate By ChipID
wireless_bridge.menu.LORAWAN_DEVEUI.1.build.LORAWAN_DEVEUI_AUTO=1

wireless_bridge.menu.LORAWAN_PREAMBLE_LENGTH.0=8(default)
wireless_bridge.menu.LORAWAN_PREAMBLE_LENGTH.0.build.LORAWAN_PREAMBLE_LENGTH=8
wireless_bridge.menu.LORAWAN_PREAMBLE_LENGTH.1=16(For M00 and M00L)
wireless_bridge.menu.LORAWAN_PREAMBLE_LENGTH.1.build.LORAWAN_PREAMBLE_LENGTH=16
##############################################################

wireless_track.name=Wireless Tracker
wireless_track.vid.0=0x303a
wireless_track.pid.0=0x1001

wireless_track.bootloader.tool=esptool_py
wireless_track.bootloader.tool.default=esptool_py

wireless_track.upload.tool=esptool_py
wireless_track.upload.tool.default=esptool_py
wireless_track.upload.tool.network=esp_ota

wireless_track.upload.maximum_size=1310720
wireless_track.upload.maximum_data_size=327680
wireless_track.upload.flags=
wireless_track.upload.extra_flags=
wireless_track.upload.use_1200bps_touch=false
wireless_track.upload.wait_for_upload_port=false

wireless_track.serial.disableDTR=false
wireless_track.serial.disableRTS=false

wireless_track.build.tarch=xtensa
wireless_track.build.bootloader_addr=0x0
wireless_track.build.target=esp32s3
wireless_track.build.mcu=esp32s3
wireless_track.build.core=esp32
wireless_track.build.variant=wireless_track
wireless_track.build.board=Wireless_Track

wireless_track.build.usb_mode=1
wireless_track.build.cdc_on_boot=0
wireless_track.build.msc_on_boot=0
wireless_track.build.dfu_on_boot=0
wireless_track.build.f_cpu=240000000L
wireless_track.build.flash_size=4MB
wireless_track.build.flash_freq=80m
wireless_track.build.flash_mode=dio
wireless_track.build.boot=qio
wireless_track.build.boot_freq=80m
wireless_track.build.partitions=default
wireless_track.build.loop_core=
wireless_track.build.event_core=
wireless_track.build.psram_type=qspi
wireless_track.build.memory_type={build.boot}_{build.psram_type}

wireless_track.menu.PSRAM.disabled=Disabled
wireless_track.menu.PSRAM.disabled.build.psram_val=
wireless_track.menu.PSRAM.disabled.build.psram_type=qspi
wireless_track.menu.PSRAM.enabled=QSPI PSRAM
wireless_track.menu.PSRAM.enabled.build.psram_val=-DBOARD_HAS_PSRAM
wireless_track.menu.PSRAM.enabled.build.psram_type=qspi
wireless_track.menu.PSRAM.opi=OPI PSRAM
wireless_track.menu.PSRAM.opi.build.psram_val=-DBOARD_HAS_PSRAM
wireless_track.menu.PSRAM.opi.build.psram_type=opi

wireless_track.menu.FlashMode.qio=QIO 80MHz
wireless_track.menu.FlashMode.qio.build.flash_mode=dio
wireless_track.menu.FlashMode.qio.build.boot=qio
wireless_track.menu.FlashMode.qio.build.boot_freq=80m
wireless_track.menu.FlashMode.qio.build.flash_freq=80m
wireless_track.menu.FlashMode.qio120=QIO 120MHz
wireless_track.menu.FlashMode.qio120.build.flash_mode=dio
wireless_track.menu.FlashMode.qio120.build.boot=qio
wireless_track.menu.FlashMode.qio120.build.boot_freq=120m
wireless_track.menu.FlashMode.qio120.build.flash_freq=80m
wireless_track.menu.FlashMode.dio=DIO 80MHz
wireless_track.menu.FlashMode.dio.build.flash_mode=dio
wireless_track.menu.FlashMode.dio.build.boot=dio
wireless_track.menu.FlashMode.dio.build.boot_freq=80m
wireless_track.menu.FlashMode.dio.build.flash_freq=80m
wireless_track.menu.FlashMode.opi=OPI 80MHz
wireless_track.menu.FlashMode.opi.build.flash_mode=dout
wireless_track.menu.FlashMode.opi.build.boot=opi
wireless_track.menu.FlashMode.opi.build.boot_freq=80m
wireless_track.menu.FlashMode.opi.build.flash_freq=80m

wireless_track.menu.FlashSize.4M=4MB (32Mb)
wireless_track.menu.FlashSize.4M.build.flash_size=4MB
wireless_track.menu.FlashSize.8M=8MB (64Mb)
wireless_track.menu.FlashSize.8M.build.flash_size=8MB
wireless_track.menu.FlashSize.8M.build.partitions=default_8MB
wireless_track.menu.FlashSize.16M=16MB (128Mb)
wireless_track.menu.FlashSize.16M.build.flash_size=16MB
#wireless_track.menu.FlashSize.32M=32MB (256Mb)
#wireless_track.menu.FlashSize.32M.build.flash_size=32MB

